Repository: CyrilleCrespy/Nsoundcursed
Catalog: locale/*/*.po
Languages: fr

source: Nsoundcursed will be closed :
fr: Fermeture de Nsoundcursed :

source: Welcome to Nsoundcursed
fr: Bienvenue dans Nsoundcursed

source: 1) Sound list
fr: 1) Liste de sons

source: 2) Help me
fr: 2) Aide

source: 3) Licence
fr: 3) License

source: 1) First steps
fr: 1) Premiers pas

source: The main menu can be managed with numeric keyboard (or more generally with numbers close the different choices. Playlist can be piloted from arrow keys to move the selected choice, or with shortcuts for choices numeroted from 1 to 9. 0 allow to go back to the main menu, 'q' makes the application quits.
fr: Le menu principal se pilote avec le pavé numérique (ou plus globalement les chiffres qui juxtent les différentes possibilités. La liste de lecture peut être pilotée avec les flèches directionnelles pour naviguer dans la liste, ou avec les raccourcis claviers pour les choix numérotés de 1 à 9. 0 permet de revenir au menu principal et 'q' de quitter l'application.

source: The file located in ~/.config/nsoundlist.conf is the foundation of this tool. It relies on a simple syntax : option=value. The application reads it at launch time. - folder defines the working directory where sounds to launch are. 1) default is automatically translated into ~/.config/nsoundconfig, by retrieving the $HOME value of the parent shell. 2) it can also be defined on which the user as reading rights.
fr: Le fichier situé dans ~/.config/nsoundlist/nsoundlist.conf sert de base à la configuration.de l'outil. Le fichier repose sur un style simple : option=valeur. Il est lu à chaque fois que l'application est lancée. — folder définit le dossier de travail où sont cherchés les sons à lancer 1) default est traduit automatiquement par ~/.config/nsoundconfig, en récupérant la valeur d'environnement $HOME du shell parent. Il peut aussi être défini au chemin absolu d'un répertoire dont l'utilisateur a les droits de lecture.

source: Licence GPLv2.0, and only thio particular version, applies to this application. It is possible to read the text in its full extent by consulting the file COPYING, which must be provided when sharing this software, either as binary or as source code. Press any key to go back to main menu.
fr: Cette application est soumise à la licence GPLv2.0 et uniquement à cette version. Il est possible de consulter le texte en consultant le fichier COPYING, qui doit être fourni lors de la transmission de ce logiciel, que ce soit sous forme binaire ou en code source. Pressez une touche pour revenir au menu.

source: Sound list (press + to add)
fr: Liste de sons (appuyez sur + pour ajouter)

source: Folder does not exist / is not reachable :
fr: Dossier introuvable ou inaccessible :

source: Loading the magic number failed.
fr: Chargement des nombres magiques impossible.

source: No MIME type detected for the file :
fr: Aucun type de fichier détecté :

source: Either cvlc isn't available, either it's not in the PATH. Installing VLC in your packet manager may solve the problem.
fr: Soit cvlc n'est pas disponible, soit il n'est pas présent dans le PATH. Installer VLC avec votre gestionnaire de paquets peut résoudre le problème.

source: Type (or paste) the absolute path of the file you want to add, or the directory whose audio files you want to copy in the nsoundcursed configuration.
fr: Entrez (ou collez) le chemin absolu du fichier que vous voulez ajouter, ou du répertoire dont vous voulez ajouter les fichiers audios dans la configuration de nsoundcursed

source: Error using stat on the required file or directory :
fr: Erreur lors de l'utilisation de stat sur le fichier ou le répertoire :

source: The file is NOT a regular file.
fr: Le fichier n'est PAS un fichier régulier.
